[
    {
        "Competence Area": "1. INFORMATION SEARCH, EVALUATION AND MANAGEMENT",
        "Description": "To articulate information needs, and to search for, locate and retrieve digital information and content. To judge the relevance of the source and its content in digital environments. To critically evaluate digital sources, content, and processes used to generate them. To store, manage, organise and analyse digital information and data.",
        "Competences": [
            {
                "Competence Title": "1.1 Browsing, searching and filtering information",
                "Competence Description": "To articulate information needs, to know how and where to search for information and content in digital environments, and to access and navigate between them. To select appropriate digital tools to create, implement and update searches in digital environments and to be able to distinguish between relevant and irrelevant information and content."
            },
            {
                "Competence Title": "1.2 Evaluating information",
                "Competence Description": "To assess and compare the credibility and reliability of sources of information and content in digital environments. To interpret and critically evaluate information and content in digital environments, and the processes used to generate them."
            },
            {
                "Competence Title": "1.3 Managing information",
                "Competence Description": "To organise, store and retrieve information and data in digital environments. To collect, process and analyse information and data in structured digital environments."
            }
        ]
    },
    {
        "Competence Area": "2. COMMUNICATION AND COLLABORATION",
        "Description": "To interact, share, communicate and collaborate in digital environments while being aware of cultural, generational and other diversity and the features and limitations of digital technologies. To participate in society through digital technologies. To assert one’s rights and exercise choice in digital environments. To manage one’s digital presence, identity and reputation.",
        "Competences": [
            {
                "Competence Title": "2.1 Interacting through and with digital technologies",
                "Competence Description": "To interact through and with a variety of digital technologies, and to use appropriate digital communication for a given context."
            },
            {
                "Competence Title": "2.2 Sharing through digital technologies",
                "Competence Description": "To share information and content ethically and responsibly with others through appropriate digital technologies."
            },
            {
                "Competence Title": "2.3 Engaging in citizenship through digital technologies",
                "Competence Description": "To participate in society through the ethical and responsible use of digital platforms and services. To seek opportunities for self-empowerment and participation through appropriate digital technologies. To be aware of and assert one’s rights, and to exercise choice, in digital environments."
            },
            {
                "Competence Title": "2.4 Collaborating through digital technologies",
                "Competence Description": "To use digital technologies ethically and responsibly for collaborative purposes, and for the coconstruction and co-creation of information, resources and knowledge."
            },
            {
                "Competence Title": "2.5 Digital behaviour",
                "Competence Description": "To be aware of behavioural norms, and to know how to behave respectfully while using digital technologies and interacting in digital environments. To adapt communication to specific contexts, and to be aware of and respect cultural, generational and other diversity in digital environments."
            },
            {
                "Competence Title": "2.6 Managing digital identity",
                "Competence Description": "To manage one or multiple digital identities. To take actions to help protect one’s digital reputation (how one is perceived based on online presence), and to manage one’s digital footprint (the data that is produced through use of and by digital platforms and services)."
            }
        ]
    },
    {
        "Competence Area": "3. CONTENT CREATION",
        "Description": "To create and edit digital content. To improve and integrate information and content into an existing body of knowledge while understanding how copyright and licences are to be applied, adopting an ethical and responsible approach in the creation, improvement and integration of digital content. To know how to apply computational thinking and programming techniques to give instructions to a computer system.",
        "Competences": [
            {
                "Competence Title": "3.1 Developing digital content",
                "Competence Description": "To use digital technologies ethically and responsibly to create and edit a variety of content. To express oneself through digital means."
            },
            {
                "Competence Title": "3.2 Integrating and re-elaborating digital content",
                "Competence Description": "To modify, refine and integrate new information and content into existing knowledge and resources to create new and original content and knowledge."
            },
            {
                "Competence Title": "3.3 Copyright and licences",
                "Competence Description": "To understand how copyright and licences, as well as associated legal and ethical issues, apply to digital content, and how to correctly apply them."
            },
            {
                "Competence Title": "3.4 Computational thinking and programming",
                "Competence Description": "To understand and implement steps to analyse a problem, recognise sub-problems, and plan and develop a sequence of instructions for a computing system to solve a given problem or to perform a specific task."
            }
        ]
    },
    {
        "Competence Area": "4. SAFETY, WELLBEING AND RESPONSIBLE USE",
        "Description": "To protect, devices, content, personal data and privacy in digital environments. To support physical, mental and social wellbeing of oneself and others, and to be aware of the benefits and risks of digital technologies for wellbeing and social inclusion.",
        "Competences": [
            {
                "Competence Title": "4.1 Protecting devices",
                "Competence Description": "To be aware of the environmental impact of digital technologies and their use, to take action to reduce such impact, and to use digital technologies to support sustainability. To apply safety and cybersecurity measures in order to protect digital devices and content."
            },
            {
                "Competence Title": "4.2 Protecting personal data and privacy",
                "Competence Description": "To be aware of the evolving nature of risks and threats in digital environments, and to have due regard to security of digital devices and their contents. To be aware of and exercise one’s rights in relation to personal data and privacy in digital environments. To evaluate and manage privacy risks and protect personal data and privacy in digital environments. To use and share one’s own and others’ personal data safely, ethically and responsibly."
            },
            {
                "Competence Title": "4.3 Supporting wellbeing",
                "Competence Description": "To use digital technologies in ways that support wellbeing and inclusion. To minimise risks and threats to physical, mental and social wellbeing of oneself and others while using digital technologies. To balance usage of digital technologies with offline activities to support wellbeing. To take action to help protect oneself and others from possible dangers in digital environments (e.g. cyberbullying, harmful content), and to know how to respond to such dangers."
            },
            {
                "Competence Title": "4.4 Environmental impacts of digital technologies",
                "Competence Description": "To be aware of the environmental impacts of digital technologies, including device production, operation, repair, recycling, disposal, data storage infrastructure, energy consumption and usage of tools and applications. To take action to reduce such impact and to use digital technologies to support sustainability."
            }
        ]
    },
    {
        "Competence Area": "5. PROBLEM IDENTIFICATION AND SOLVING",
        "Description": "To identify and assess needs, and to use digital technologies and adapt digital environments to meet these needs. To identify and resolve technical and conceptual problems and problem situations in digital environments. To use digital technologies to make improvements in, or new solutions for, processes and products. To build capabilities to operate autonomously in digital environments. To stay informed about digital technological developments and their implications.",
        "Competences": [
            {
                "Competence Title": "5.1 Identifying and solving technical problems",
                "Competence Description": "To identify technical problems when operating digital devices and in digital environments, and to solve them through a variety of means."
            },
            {
                "Competence Title": "5.2 Identifying needs and digital technological responses",
                "Competence Description": "To assess one’s own and others’ needs and to evaluate, select, use and adapt digital technologies to meet these needs. To adjust and customise digital environments to the contexts, goals and needs (e.g. accessibility) of oneself and others."
            },
            {
                "Competence Title": "5.3 Identifying creative solutions using digital technologies",
                "Competence Description": "To use digital technologies to make improvements in or new solutions for processes and products, using a human-centric approach. To engage individually and collectively in critical thinking processes, and the creative and purposeful use of digital technologies, to understand and resolve conceptual problems and problem situations."
            },
            {
                "Competence Title": "5.4 Identifying and addressing digital competence needs",
                "Competence Description": "To recognise where one’s own digital competence needs to be improved or updated. To address digital competence needs within a broader process of lifelong learning, building capacity and autonomy. To support others with their digital competence development. To stay informed about digital technological developments and their personal, professional and societal implications."
            }
        ]
    }
]